<template>
  <div>
    <Header :auth="false" :area="false" :minheight="75" :balance="0" :bonus="0" :clientId="''" :clientName="''" />
    <div class="aside">
      
    </div>
    <div class="main">
      <div style="margin-top: 25px; width:85%;">
        <div style="text-align: left;">
          <p><a style="cursor: pointer;" @click="$router.push({ name: 'Home' })">ISP</a> > Техническая поддержка > Ошибки подключения</p>
          <p class="newsHeader">
            Ошибки подключения к Интернет
          </p>
          <p>400 600 604 611 617 619 624 629 630 635 650 678 691 720 734 735 741 752 781 789 800</p>
            <p>Если при запуске VPN-соединения возникла ошибка, то Вам необходимо запомнить ее трехзначный код. Как правило, ошибки имеют код 6ХХ (ошибки, связанные с некорректным вводом пароля, имени или выбора типа протокола связи и говорят о том, что сеть работает, но необходимо проверить вводимые данные), 7ХХ(ошибки, связанные с некорректными настройками соединения и говорят о том, что сеть работает, но необходимо проверить настройки) или 8ХХ (ошибки, связанные с проблемами в настройке сети или отсутствием подключения к сети). Ниже приведены расшифровки некоторых кодов:</p>

            <p>400 Bad Request</p>
            <p>Означает, что сервер обнаружил в запросе клиента синтаксическую ошибку.</p>
            <p>Совет:</p>
            <p>1. Отключить межсетевой экран (брандмауэр) или программы, влияющие на сетевую активность и безопасность.</p>
            <p>2. Попробовать обновить текущий браузер или использовать другой.</p>
            <p>3. Поставить настройки браузера по-умолчанию и обнулить все сохраненные файлы, сертификаты и прочее, т.е. удалить все что пишет браузер на диск.</p>

            <p>600, 601, 603, 606, 607, 610, 613, 614, 616, 618, 632, 635, 637, 638, 645</p>
            <p>Совет:</p>
            <p>Перезагрузите компьютер. Если ошибка не исчезает, попробуйте переустановить VPN-соединение. Проверьте Ваш компьютер на предмет наличия вирусов. Удалите недавно установленные программы, либо отмените недавние изменения в настройках Windows, если такие были.</p>

            <p>604, 605, 608, 609, 615, 620</p>
            <p>Файл телефонной книги подсистемы удаленного доступа Windows и текущая конфигурация Удаленного Доступа к Сети несовместимы друг с другом</p>
            <p>Совет:</p>
            <p>Перезагрузите компьютер. Если ошибка не исчезает, то удалите и заново создайте VPN соединение.</p>

            <p>611, 612</p>
            <p>Внутренняя конфигурация сети Windows некорректно настроена</p>
            <p>Совет:</p>
            <p>Перезагрузите компьютер и убедитесь, что локальная сеть нормально функционирует на Вашем компьютере. Если ошибка не исчезает, то обращайтесь в службу тех. поддержки. Кроме того, ошибка может быть вызвана нехваткой ресурсов (памяти) на Вашем компьютере. Попробуйте закрыть запущенные программы.</p>

            <p>617</p>
            <p>Windows находится в процессе подключения к Интернету, либо произошла внутренняя ошибка Windows</p>
            <p>Совет:</p>
            <p>Подождите несколько минут. Если подключение не установилось, и при повторном подключении ошибка повторяется, то перезагрузите компьютер.</p>

            <p>619</p>
            <p>Неправильно настроены параметры безопасности VPN соединения, VPN-трафик блокируется на пути к шлюзу, либо настройки VPN не вступили в действие</p>
            <p>Совет:</p>
            <p>В свойствах VPN соединения откройте вкладку «Безопасность» – должно быть выбрано «Обычные (рекомендуемые параметры)» и должна быть снята галочка «Требуется шифрование данных (иначе отключаться)». Перезагрузите компьютер и попробуйте подключиться еще раз. Проверьте настройки Вашего брандмауэра (должен быть открыт порт для передачи данных vpn-соединения через порт 1723 TCP с использованием протокола GRE(47)), и, если не уверены в их правильности, отключите его.</p>

            <p>624</p>
            <p>проблема при подключении к VPN</p>
            <p>Совет:</p>
            <p>1. Отсутствует файл RASPHONE.PBK в {папка с Windows}/system32/RAS или … Documents and Settings/{ваш юзер или все юзеры}/Application Data/Microsoft/Network/Connections/Pbk, а если даже и есть, то необходимо переименовать его во что-то другое, например RASPHONE.OLD, еще можно запустить rasphone.exe, может помочь.</p>
            <p>2. Стоит запрет на создание подключения. – Разрешить пользователям создавать новые подключения. Пуск – Выполнить – gpedit.msc и там разбираться.</p>
            <p>3. Запрещён доступ к папке Documents and Settings/All Users/Application Data/Microsoft/Network/Connections/Pbk – Открыть доступ к папке. Но скорее всего проблему удастся решить таким образом: снять галку с пункта «Только для чтения» в свойствах файла Rasphone.pbk.</p>

            <p>629</p>
            <p>Соединение не может быть установлено (блокировано подключение по протоколу TCP к VPN-серверу). </p>
            <p>Совет:</p>
            <p>Проверьте настройки Вашего брандмауэра, и, если не уверены в их правильности, отключите его.</p>

            <p>630</p>
            <p>Модем (или другое устройство подключения) был отключен из-за ошибки оборудования. </p>
            <p>Совет</p>
            <p>Переустановить драйвера Вашего сетевого адаптера</p>

            <p>635</p>
            <p>Неизвестная ошибка.</p>
            <p>VPN-клиент на Вашем компьютере имеет ошибки либо установлен неправильно.</p>
            <p>Совет:</p>
            <p>Как правило, такая проблема может возникнуть на ОС Windows 95/98/ХР/NT. Для решения требуется переустановить VPN-клиент или систему Windows.</p>

            <p>650</p>
            <p>Сервер удаленного доступа не отвечает</p>
            <p>Совет:</p>
            <p>Недоступен сервер-VPN. Проверьте, включено ли «Подключение по локальной сети», исправна ли сетевая карта, исправен ли сетевой кабель, не выставлен ли в настройках VPN-соединения какой-то определённый IP-адрес.</p>

            <p>678</p>
            <p>Не удалось установить подключение, поскольку удаленный компьютер не ответил на запрос подключения. </p>
            <p>Совет:</p>
            <p>1. Проверьте правильность IP-адреса VPN-сервера и повторите попытку подключения. Чтобы просмотреть свойства подключения, щелкните нужное подключение правой кнопкой мыши, выберите команду Свойства, а затем просмотрите сведения на вкладке Общие.</p>
            <p>2. Попытки подключения могут блокироваться сетевым устройством, таким как брандмауэр, или в результате перегрузки сети.</p>

            <p>691</p>
            <p>Доступ запрещен, поскольку такое имя пользователя и пароль недопустимы в этом домене</p>
            <p>Совет:</p>
            <p>1. Нет денег (войдите на сервер статистики и проверьте наличие средств на счете)</p>
            <p>2. Неправильный логин или пароль (Обратите внимание на регистр вводимых букв и состояние переключателя языка клавиатуры RU/EN)</p>
            <p>3. Неправильно указан в настройках сервер VPN (лимитный 80.252.128.110 или анлим 10.255.255.32)</p>
            <p>4. Стоит административная блокировка в системе статистики.</p>
            <p>5. Убедитесь, что в свойствах VPN подключения (VPN-Свойства->Параметры->Параметры набора номера) не отмечен галочкой параметр «Включать домен входа в Windows»</p>
            <p>6. Возможно, вы подключились к сети Интернет, но соединение было некорректно разорвано – необходимо подождать 2-4 минуты перед повторным подключением к VPN-серверу</p>

            <p>720</p>
            <p>Не удалось подключиться с помощью этого элемента телефонной книги. </p>
            <p>Совет:</p>
            <p>В свойствах VPN-соединения, в закладке «Сеть» проверьте наличие копонента «Протокол интернета (ТСР/IP)» и отметьте его галочкой.</p>

            <p>734</p>
            <p>Работа протокола управления каналом PPP была прервана. </p>
            <p>Совет:</p>
            <p>В свойствах VPN-соединения во вкладке «Безопасность» убрать галочку «Требуется шифрование данных»</p>

            <p>735</p>
            <p>Запрошенный адрес был отвергнут сервером</p>
            <p>Совет:</p>
            <p>Вы неправильно настроили VPN-соединение для доступа в сеть Интернет. Скорее всего, в настройках TCP/IP соединения VPN вы прописали какой-то IP-адрес, а он должен выделятся автоматически</p>

            <p>738</p>
            <p>Серверу не удается выдать IP адрес. Соединение с таким логином и паролем уже установлено. Обратиться к Администратору.</p>
            <p>Совет:</p>
            <p>1. Возможно, злоумышленники украли логин и пароль.</p>
            <p>2. «Подвисла» VPN сессия. Необходимо подождать 5 минут и повторить подключение</p>

            <p>741 – 743</p>
            <p>Неверно настроены параметры шифрования</p>
            <p>Совет:</p>
            <p>Зайдите в настройки VPN соединения, и во вкладке «Безопасность» снимите галочку «шифрование данных»</p>

            <p>752</p>
            <p>Не удалось установить подключение к серверу.</p>
            <p>Совет:</p>
            <p>1. неверно настроенный локальный файрвол.</p>
            <p>2. некто изменил атрибуты доступа (вместо VPN – международный телефонный номер)</p>

            <p>781</p>

            <p>Попытка кодирования не удалась, потому что не было найдено ни одного действительного сертификата.</p>
            <p>Причины возникновения: VPN клиент пытается использовать L2TP/IPSec протокол для подключения.</p>
            <p>Совет:</p>
            <p>Войдите в настройки подключения VPN-Свойства->Сеть->Тип VPN и выберите PPTP VPN</p>

            <p>789</p>
            <p>Выбран неверный тип VPN соединения</p>
            <p>Совет:</p>
            <p>Зайдите в настройки VPN соединения и на вкладке «Сеть» из списка «Тип VPN» выберите «Автоматически» или “PPTP VPN”. Попробуйте повторно подключиться</p>

            <p>800</p>
            <p>Не удалось создать VPN-подключение. Сервер недоступен или параметры безопасности для данного подключения настроены неверно</p>
            <p>Возможные причины:</p>
            <p>1. Фаерволл блокирует исходящие запросы на VPN соединения</p>
            <p>2. Отсутствует подключение к локальной сети.</p>
            <p>3. некто изменил атрибуты доступа (вместо vpn – международный телефонный номер).</p>
            <p>4. Запрос по какой-либо причине не доходит до сервера, т.е. возможно шлюз вашего сегмента не пропускает запрос в силу возникшей нагрузки или сбоя.</p>
            <p>5. разрушение стека</p>
            <p>Совет:</p>
            <p>1. В фаерволе необходимо открыть TCP порт 1723 и IP протокол 47 (GRE), или, если того требуют настройки фаервола, прописать IP адрес Вашего VPN-сервера (IP указан в информации для клиента)..</p>
            <p>2. Проверить есть ли физическая связь (горят ли лампочки сетевой карты на задней панели Вашего компьютера), включен ли сетевой кабель в разъем на сетевой карте и в розетке (при ее наличии). Затем проверить, включено ли соединение по локальной сети. Для этого нажмите кнопку «Пуск», затем «Панель управления», затем «Cетевые подключения». В появившемся окне найдите «Подключение по локальной сети» и включите его, если оно было выключено. Проверить настройки протокола TCP/IP – Нажмите кнопку «Пуск»->»Выполнить». В строке введите команду “cmd”, в открывшемся DOS окне введите команду “ipconfig” – должно выдать Ваш IP адрес, маску подсети и основной шлюз, если данной информации нет означает что локальная сеть выключена или нет физического соединения.</p>
            <p>3. Убедитесь, что в настройках VPN подключения (VPN-Свойства->Общие->Имя компьютера или IP-адрес назначения) верно указан адрес VPN-сервера.</p>
            <p>4. Проверить прохождение сигнала командой ping до Вашего шлюза, а затем до вашего сервера VPN.</p>
            <p>Нажмите кнопку «Пуск»->»Выполнить». В строке введите команду “cmd”, в открывшемся DOS окне введите команду:</p>
            <p>ping 192.168.100.254</p>
            <p>ping 80.252.128.110 (10.255.255.32)</p>
            <p>где в данном случае 80.252.128.110 – сервер VPN, а 192.168.100.254 – адрес шлюза. Свой сервер доступа и адрес шлюза Вы можете узнать в «анкете абонента» или используя команду “ipconfig” (смотри пункт 2).</p>
            <p>Если в открывшемся DOS-окне Вы увидите что-то вроде «Заданный узел недоступен» или «Превышен интервал ожидания для запроса», то возможно проблемы у Вас на компьютере, либо на линии. Если пойдет ответ от узла с указанной скоростью (обычно это происходит быстро), то скорее всего проблема в Вашем компютере. В любом случае проверьте второй пункт (2).</p>
            <p>5. Разрушение стека – описание некого общего сбоя при взаимодействии сетевых компонентов составляющих TCP/IP стек. Причинами для возникновения может быть повреждение файлов ОС (дисковый сбой), вторжение вирусов и троянских программ, ошибки при реконфигурации (не дали дистрибутив, не удалили старый драйвер сетевой карты перед установкой новой). Исправляется восстановлением поврежденных файлов, удалением вирусов, и Переустановкой Windows. Установить и настроить заново сетевые компоненты и подключение к VPN в соответствии с инструкциями по настройке сети.</p>
          </p>
        </div>
      </div>
    </div>
    <br style="clear: both"/>
    <Footer />
  </div>
</template>

<script>
import Footer from '@/components/Footer.vue'
import Header from '@/components/Header.vue'

export default {
  name: 'News',
  data(){
    return {
      news: []
    }
  },
  methods: {
    
  },
  mounted(){
    fetch(`http://localhost:4000/home/`, {
      mode: 'cors',
      method: 'GET'
    }).then(response => response.body).then(rb  => {
      const reader = rb.getReader()
      return new ReadableStream({
        start(controller) {
          function push() {
            reader.read().then( ({done, value}) => {
              if (done) {
                console.log('done', done);
                controller.close();
                return;
              }
              controller.enqueue(value);
              console.log(done, value);
              push();
            })
          }
          push();
        }
      });
    }).then(stream => {
      return new Response(stream, { headers: { "Content-Type": "text/html" } }).text();
    })
    .then(result => {
      console.log(`JSON.parse(result): ${JSON.parse(result)}`)
      this.news = JSON.parse(result).news
    });
  },
  components: {
    Header,
    Footer
  }
}
</script>
<style scoped>
  .aside {
    float: left;
    height: 2300px;
    width: 15%;
    background-color: rgb(205, 205, 205);
  }
  .main {
    background-color: rgb(225, 225, 225);
    width: 85%;
    text-align: center;
    display: flex;
    flex-direction: column;
    align-items: center;
    float: left;
    height: 2300px;
    overflow-y: auto;
  }

  .header {
    height: 75px;
    width: 100%;
    background-color: rgb(235, 235, 235);
  }

  .footer {
    height: 175px;
    width: 100%;
    background-color: rgb(185, 185, 185);
    overflow: hidden;
  }

  .footerLinks {
    display: flex;
    justify-content: space-around;
    width: 75%;
    height: 45px;
    margin: auto;
  }

  .logo {
    font-size: 24px;
    font-weight: bolder;
  }

  .footerDescription {
    font-size: 11px;
  }

  .ads {
    width: 50%;
    
    background-color: rgb(0, 0, 0); 
  }

  .rates {
    display: flex;
    justify-content: space-around;
    width: 90%;
    margin: auto;
  }

  .rate {
    width: 100%;
    margin: 15px;
    border: 1px solid white;
    color: white;
    font-weight: bolder;
  }

  .rateHeader {
    font-size: 18px;
    font-weight: bolder;
  }

  .rateSubheader {
    font-size: 12px;
  }

  .rateFeature {
    display: flex;
    flex-direction: column;
    margin: 35px 0px;
    line-height: 5px;
  }

  .plugInBtn {
    width: 125px;
    font-size: 12px;
    margin: 5px;
  }

  .otherRatesBtn {

  }

  .news {
    margin: auto;
    width: 75%;
    text-align: left;
  }

  .newsHeader {
    font-weight: bolder;
    font-size: 24px;
  }

  .newsItemHeader {
    font-weight: bolder;
  }

  .newsItem {
    font-weight: bolder;
  }

  .socialMedia {
    display: flex;
    flex-direction: row;
    justify-content: flex-end;
    width: 100%;
  }
  .socialMediaItem {
    margin: 5px;
  }

  .billboards {
    
  }

  .billboard {
    width: 100%;
  }

  .personalArea {
    cursor: pointer;
  }

</style>