<template>
  <div>
    <Header :auth="false" :area="false" :minheight="75" :balance="0" :bonus="0" :clientId="''" :clientName="''" />
    <div class="aside">
      
    </div>
    <div class="main">
      <div style="margin-top: 25px; width:85%;">
        <div style="text-align: left;">
          <p><a style="cursor: pointer;" @click="$router.push({ name: 'Home' })">ISP</a> > Интернет для дома > Тарифы > Частный дом по индивидуальному радиоканалу</p>
          <p class="newsHeader">
            Беспроводной Интернет по индивидуальному радиоканалу частный дом (квартиру).
          </p>
          <div>
            <p>
               Данные тарифы распространяются на случаи, когда подключение к сети Интернет производится путём организации индивидуального радиоканала к Вам домой. При этом у Вас дома устанавливается комплект специального оборудования и осуществляется его настройка. Такой тип подключения позволяет подключить Интернет домой даже в тех местах, где полностью отсутствует сетевая инфраструктура Интернет провайдеров.

              Для Вашего удобства мы разработали систему on-line заявок с нашего сайта:

              Оставить заявку на подключение

              Заполните краткую форму заявки оставив свой контактный телефон. По указанному Вами телефону с Вами сразу свяжутся наши специалисты и ответят на интересующие Вас вопросы. При необходимости к Вам выедут наши специалисты и проведут процедуру обследования на предмет технической возможности. Процедура обследования абсолютно бесплатна и не потребует Вашего личного присутствия.

              Стоимость подключения к сети Интернет по выделенной линии с авторизацией на VPN-сервере для физических лиц


              Технология	
              Скорость нефиксированная (Мбит/с)

              Размер единоразового платежа (руб. с НДС)*

              Радио с авторизацией на VPN-сервере (отдельная радиоточка)

              до 50

              12000

              ВОЛС с авторизацией на VPN-сервере (коллективная магистральная радиоточка)

              до 50

              10000

              Примечание:   * при наличии тех возможности

              Тарифные планы доступа к сети Интернет по выделенной линии с авторизацией на VPN-сервере для физических лиц, подключенных по ВОЛС к коллективной радиоточке


              Наименование тарифного плана	
              Аббревиатура тарифного плана

              Абон. плата (руб./мес.)

              Скорость до **
              (Мбит/с)

              Лимит трафика(Мбайт)

              Цена превыше-
              ния (руб.)

              1

              2

              3

              4

              5

              6

              Бронирование линии

              Бронирование линии

              200

              0

              -

              -

              Безлимитные тарифные планы «Малая Родина на связи»

              Удаленный доступ для трудоголиков

              u20M/399

              399

              20

              -

              -

              Супер для любетелей кино и игр

              U30M/650

              650

              30

              -

              -

              Премиум для любетелей кино и игр

              U50M/990

              990

              50

              -

              -

              Индивидуальный

              "Выбирай"

              ***

              50+

              -

              -

              Тарифные планы доступа к сети Интернет по выделенной линии с авторизацией на VPN-сервере для физических лиц, подключенных к отдельной радиоточке


              Наименование тарифного плана	
              Аббревиатура тарифного плана

              Абон. плата (руб./мес.)

              Скорость до **
              (Мбит/с)

              Лимит трафика(Мбайт)

              Цена превыше-
              ния (руб.)

              1

              2

              3

              4

              5

              6

              Бронирование линии

              Бронирование линии

              200

              0

              -

              -

              Безлимитные тарифные планы «Малая Родина на связи»

              Удаленный доступ для трудоголиков

              U10M/999

              999

              10

              -

              -

              Удаленный доступ для продвинутых трудоголиков

              U20M/1190

              1190

              20

              

              

              Супер для любетелей кино и игр

              U30M/1399

              1399

              30

              -

              -

              Премиум для любетелей кино и игр

              U50M/1790

              1790

              50

              -

              -

              Индивидуальный

              "Выбирай"

              ***

              50+

              -

              -

              

              Примечание:
              *** Индивидуальный тарифный план создается с учетом пожеланий клиента и технической возможности, позволяет заказать подключение к Интернет на скорости более 20 Мбит/с, стоимость подключения и абонентская плата рассчитывается индивидуально, в зависимости от нахождения объекта подключения и требуемой скорости.

              Цены указаны в рублях РФ и включают НДС.
              Деньги за пользование Интернетом снимаются с лицевого счета абонента отдельно за каждое соединение с сервером VPN. Для расчета используется большая величина входящего или исходящего трафика.
              При отрицательном сальдо лицевого счета АБОНЕНТА предоставление услуг приостанавливается без предварительного уведомления. Абонентская плата, указанная в тарифном плане, снимается с лицевого счета Абонента ежедневно равными долями в течение месяца. В случае отсутствия средств на лицевом счете Абонента, абонентская плата продолжает сниматься с лицевого счета, образуя задолженность Абонента перед Оператором. По письменному заявлению ООО «ФЛЕКС» может произвести перерасчет задолженности из расчета 200 руб. в месяц -  за техническое обслуживание соединительной линии, резервировании порта и радиоресурса. Срок задолженности определяется с месяца, в котором Ваш лицевой счет обнулился.
              Заявки на смену тарифного плана доступа к сети Интернет принимаются в письменном виде до 25 числа текущего месяца. Ввод в действие вновь выбранного тарифного плана осуществляется с 1-го числа следующего месяца.  Возможность перехода на конкретный тарифный план определяется составом установленного клиентского оборудования.
              **Скорость, указанная в тарифных планах, не является гарантированной. Под этой величиной понимается максимальная скорость, которая может быть получена на данном тарифном плане (скорость порта). Она зависит от многих факторов, в том числе от загруженности ресурсов, к которым обращается пользователь, от повышенной вирусной активности в сети, а так же от загрузки каналов связи.
            </p>
          </div>
        </div>
      </div>
    </div>
    <br style="clear: both"/>
    <Footer />
  </div>
</template>

<script>
import Footer from '@/components/Footer.vue'
import Header from '@/components/Header.vue'

export default {
  name: 'SmartIntercom',
  data(){
    return {
      
    }
  },
  methods: {
    
  },
  mounted(){
    fetch(`http://localhost:4000/home/`, {
      mode: 'cors',
      method: 'GET'
    }).then(response => response.body).then(rb  => {
      const reader = rb.getReader()
      return new ReadableStream({
        start(controller) {
          function push() {
            reader.read().then( ({done, value}) => {
              if (done) {
                console.log('done', done);
                controller.close();
                return;
              }
              controller.enqueue(value);
              console.log(done, value);
              push();
            })
          }
          push();
        }
      });
    }).then(stream => {
      return new Response(stream, { headers: { "Content-Type": "text/html" } }).text();
    })
    .then(result => {
      console.log(`JSON.parse(result): ${JSON.parse(result)}`)
      this.news = JSON.parse(result).news
    });
  },
  components: {
    Header,
    Footer
  }
}
</script>
<style scoped>
  .aside {
    float: left;
    height: 2300px;
    width: 15%;
    background-color: rgb(205, 205, 205);
  }
  .main {
    background-color: rgb(225, 225, 225);
    width: 85%;
    text-align: center;
    display: flex;
    flex-direction: column;
    align-items: center;
    float: left;
    height: 2300px;
  }

  .header {
    height: 75px;
    width: 100%;
    background-color: rgb(235, 235, 235);
  }

  .footer {
    height: 175px;
    width: 100%;
    background-color: rgb(185, 185, 185);
    overflow: hidden;
  }

  .footerLinks {
    display: flex;
    justify-content: space-around;
    width: 75%;
    height: 45px;
    margin: auto;
  }

  .logo {
    font-size: 24px;
    font-weight: bolder;
  }

  .footerDescription {
    font-size: 11px;
  }

  .ads {
    width: 50%;
    
    background-color: rgb(0, 0, 0); 
  }

  .rates {
    display: flex;
    justify-content: space-around;
    width: 90%;
    margin: auto;
  }

  .rate {
    width: 100%;
    margin: 15px;
    border: 1px solid white;
    color: white;
    font-weight: bolder;
  }

  .rateHeader {
    font-size: 18px;
    font-weight: bolder;
  }

  .rateSubheader {
    font-size: 12px;
  }

  .rateFeature {
    display: flex;
    flex-direction: column;
    margin: 35px 0px;
    line-height: 5px;
  }

  .plugInBtn {
    width: 125px;
    font-size: 12px;
    margin: 5px;
  }

  .otherRatesBtn {

  }

  .news {
    margin: auto;
    width: 75%;
    text-align: left;
  }

  .newsHeader {
    font-weight: bolder;
    font-size: 24px;
  }

  .newsItemHeader {
    font-weight: bolder;
  }

  .newsItem {
    font-weight: bolder;
  }

  .socialMedia {
    display: flex;
    flex-direction: row;
    justify-content: flex-end;
    width: 100%;
  }
  .socialMediaItem {
    margin: 5px;
  }

  .billboards {
    
  }

  .billboard {
    width: 100%;
  }

  .personalArea {
    cursor: pointer;
  }

</style>