<template>
  <div>
    <Header :auth="false" :area="false" :minheight="75" :balance="0" :bonus="0" :clientId="''" :clientName="''" />
    <div class="aside">
      
    </div>
    <div class="main">
      <div style="margin-top: 25px; width:85%;">
        <div style="text-align: left;">
          <p><a style="cursor: pointer;" @click="$router.push({ name: 'Home' })">ISP</a> > Интернет для дома > Тарифы > (для квартир)</p>
          <p class="newsHeader">
            <span style="display: block;">Тарифные планы</span>
            <b>(для квартир)</b>
          </p>
          <div>
            <p>
              Основные тарифные планы, с возможностью смены в личном кабинете
              тв100М/ТВ+/499р
              Скорость*
              100
              Мбит/сек
              Телевидение в пакете
              от 193 каналов + IVI
              Список каналов
              Стоимость
              499
              рублей в месяц
              ПОДКЛЮЧИТЬ
              Супер u100M/399р
              Скорость*
              100
              Мбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              399
              рублей в месяц
              ПОДКЛЮЧИТЬ
              тв50M/ТВ/390р
              Скорость*
              50
              Мбит/сек
              Телевидение в пакете
              от 120 каналов
              Список каналов
              Стоимость
              390
              рублей в месяц
              ПОДКЛЮЧИТЬ
              Комфорт u50M/300р
              Скорость*
              50
              Мбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              300
              рублей в месяц
              ПОДКЛЮЧИТЬ
              Стандарт u25M/250р
              Скорость*
              25
              Мбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              250
              рублей в месяц
              ПОДКЛЮЧИТЬ
              Эконом u6M/200р
              Скорость*
              6
              Мбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              200
              рублей в месяц
              ПОДКЛЮЧИТЬ
              Высокоскоростные тарифные планы, с возможностью смены по заявлению
              1Гб/1790р
              Скорость*
              1
              Гбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              1790
              рублей в месяц
              ПОДКЛЮЧИТЬ
              500М/890р
              Скорость*
              500
              Мбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              890
              рублей в месяц
              ПОДКЛЮЧИТЬ
              200М/590р
              Скорость*
              200
              Мбит/сек
              Телевидение в пакете
              Без ТВ
              Подключается дополнительно
              Стоимость
              590
              рублей в месяц
              ПОДКЛЮЧИТЬ
              Единовременные платежи
              Подключение к сети Интернет на тарифы до 150 Мбит/сек. (вся сумма зачисляется на лицевой счёт абонента за исключением домов, в разделе Подключенные дома отмеченные звездочкой *)	
              Подключение к сети Интернет на высокоскоростные тарифы от 100 Мбит/сек.	2900
              Смена тарифного плана до 100 Мбит/сек.	бесплатно
              Смена тарифного плана от 100 Мбит/сек.	1900
              Регистрация статического IP-адреса	420
              Периодические платежи
              Поддержка статического IP-адреса (ежемесячно руб.)	140
              Стоимость услуг
              Наименование услуг
              Единовременная плата за подключение к сети Интернет на тарифы до 150 Мбит/сек.	1000 руб. Вся сумма зачисляется на лицевой счёт абонента (за исключением домов, в разделе Подключенные дома отмеченные звездочкой *)
              Единовременная плата за подключение к сети Интернет на высокоскоростные тарифы от 150Мбит/сек.	2900 руб. 1000 рублей зачисляется на лицевой счёт абонента
              Стоимость работ при изменении тарифного плана до 150 Мбит/сек., единовременно	бесплатно
              Стоимость работ при изменении тарифного плана от 150 Мбит/сек., единовременно	1900 руб.
              Регистрация первого почтового ящика электронной почты	бесплатно
              Поддержка первого почтового ящика объемом до 5мб
              (в домене flexuser.ru)	бесплатно
              Регистрация каждого дополнительного почтового ящика	84 руб.
              Поддержка первого почтового ящика объемом до 5мб
              (в домене noginsk.ru)	84 руб./мес
              Поддержка первого почтового ящика без ограничения объема
              (в домене flexuser.ru)	28 руб./1Мб/мес
              Поддержка каждого дополнительного почтового ящика	84 руб./мес
              Регистрация реального статического IP-адреса	420 руб.
              Абонентская плата за реальный статический IP-адрес	140 руб./мес
              Дополнительные услуги
              Перечень дополнительных услуг
              Выезд специалиста на объект абонента	300 руб.
              Ремонтные работы	150 руб./час
              Изготовление дубликата договора по запросу абонента	90 руб.
              Перемонтаж оборудования при смене адреса нахождения клиентского оборудования (при наличии технической возможности)	50% стоимости подключения
              Подключение дополнительного компьютера (при наличии технической возможности)	50% стоимости подключения
              Повторная настройка программного обеспечения для доступа в ИНТЕРНЕТ (при установленных у абонента ОС и ПП фирмы Microsoft)	300 руб.
              Переоформление договора на другое лицо (смена собственника)	350 руб.

              Телематические услуги

              Перечень телематических услуг
              Организация домена в зоне .ru («ваше-имя».ru)
              Организация и поддержка в течение первого года	900 руб.
              Поддержка в течение последующих лет	900 руб./год
              Поддержка первичной зоны DNS (для «ваше-имя».ru)
              Организация	600 руб.
              Поддержка	300 руб./мес.
              Поддержка вторичной зоны DNS (для «ваше-имя».ru)
              Организация	бесплатно
              Поддержка	бесплатно
              Организация домена в зоне noginsk.ru, flex.ru (для «ваше-имя».*.ru)
              Организация	600 руб.
              Поддержка	60 руб./мес.
              Использование электронной почты
              Регистрация почтового ящика	84 руб.
              Поддержка почтового ящика	84 руб./мес.
              Для абонентов ООО «ФЛЕКС» регистрация и поддержка первого почтового ящика осуществляется бесплатно
              * Скорость указанная в тарифе, является максимально возможной. Реальная скорость скачивания может отличаться от указанной в тарифе.
            </p>
          </div>
        </div>
      </div>
    </div>
    <br style="clear: both"/>
    <Footer />
  </div>
</template>

<script>
import Footer from '@/components/Footer.vue'
import Header from '@/components/Header.vue'

export default {
  name: 'SmartIntercom',
  data(){
    return {
      
    }
  },
  methods: {
    
  },
  mounted(){
    fetch(`http://localhost:4000/home/`, {
      mode: 'cors',
      method: 'GET'
    }).then(response => response.body).then(rb  => {
      const reader = rb.getReader()
      return new ReadableStream({
        start(controller) {
          function push() {
            reader.read().then( ({done, value}) => {
              if (done) {
                console.log('done', done);
                controller.close();
                return;
              }
              controller.enqueue(value);
              console.log(done, value);
              push();
            })
          }
          push();
        }
      });
    }).then(stream => {
      return new Response(stream, { headers: { "Content-Type": "text/html" } }).text();
    })
    .then(result => {
      console.log(`JSON.parse(result): ${JSON.parse(result)}`)
      this.news = JSON.parse(result).news
    });
  },
  components: {
    Header,
    Footer
  }
}
</script>
<style scoped>
  .aside {
    float: left;
    height: 2300px;
    width: 15%;
    background-color: rgb(205, 205, 205);
  }
  .main {
    background-color: rgb(225, 225, 225);
    width: 85%;
    text-align: center;
    display: flex;
    flex-direction: column;
    align-items: center;
    float: left;
    height: 2300px;
  }

  .header {
    height: 75px;
    width: 100%;
    background-color: rgb(235, 235, 235);
  }

  .footer {
    height: 175px;
    width: 100%;
    background-color: rgb(185, 185, 185);
    overflow: hidden;
  }

  .footerLinks {
    display: flex;
    justify-content: space-around;
    width: 75%;
    height: 45px;
    margin: auto;
  }

  .logo {
    font-size: 24px;
    font-weight: bolder;
  }

  .footerDescription {
    font-size: 11px;
  }

  .ads {
    width: 50%;
    
    background-color: rgb(0, 0, 0); 
  }

  .rates {
    display: flex;
    justify-content: space-around;
    width: 90%;
    margin: auto;
  }

  .rate {
    width: 100%;
    margin: 15px;
    border: 1px solid white;
    color: white;
    font-weight: bolder;
  }

  .rateHeader {
    font-size: 18px;
    font-weight: bolder;
  }

  .rateSubheader {
    font-size: 12px;
  }

  .rateFeature {
    display: flex;
    flex-direction: column;
    margin: 35px 0px;
    line-height: 5px;
  }

  .plugInBtn {
    width: 125px;
    font-size: 12px;
    margin: 5px;
  }

  .otherRatesBtn {

  }

  .news {
    margin: auto;
    width: 75%;
    text-align: left;
  }

  .newsHeader {
    font-weight: bolder;
    font-size: 24px;
  }

  .newsItemHeader {
    font-weight: bolder;
  }

  .newsItem {
    font-weight: bolder;
  }

  .socialMedia {
    display: flex;
    flex-direction: row;
    justify-content: flex-end;
    width: 100%;
  }
  .socialMediaItem {
    margin: 5px;
  }

  .billboards {
    
  }

  .billboard {
    width: 100%;
  }

  .personalArea {
    cursor: pointer;
  }

</style>